import random
print("您好~歡迎使用旅遊行程小幫手!")

#====資料====
spots={
"台北":{"景點":[
            {"name":"台北101","desc":"台北地標,360度觀景台俯瞰台北市"},
            {"name":"故宮博物院","desc":"欣賞世界頂級的中華藝術珍品"},
            {"name":"華山、松山文創園區","desc":"經常舉辦藝文展覽和活動"}],
        "美食":["小籠包","牛肉麵","芒果冰"]},
"新北":{"景點":[
            {"name":"九份","desc":"體驗山城懷舊氛圍"},
            {"name":"淡水漁人碼頭","desc":"欣賞落日美景"},
            {"name":"平溪與十分老街","desc":"放天燈許願，欣賞十分瀑布"}],
        "美食":["淡水阿給","九份芋圓","臭豆腐"]},
"桃園":{"景點":[
            {"name":"大溪老街","desc":"體驗懷舊氛圍，品嚐在地美食"},
            {"name":"Xpark水族館","desc":"觀賞豐富的海洋生物"},
            {"name":"華泰名品城","desc":"美式休閒風格的購物中心"}],
        "美食":["大溪豆乾","米干","石門活魚料理"]},
"台中":{"景點":[
            {"name":"台中歌劇院","desc":"欣賞世界級的建築設計與表演藝術"},
            {"name":"審計新村","desc":"充滿懷舊與創意的老舊宿舍"},
            {"name":"高美濕地","desc":"絕美的夕陽景色"}],
        "美食":["太陽餅","珍珠奶茶","明倫蛋餅"]},
"台南":{"景點":[
            {"name":"安平老街","desc":"體驗傳統文化和美食"},
            {"name":"赤崁樓","desc":"具有歷史價值的古蹟"},
            {"name":"奇美博物館","desc":"充滿藝術氣息的博物館"}],
        "美食":["牛肉湯","棺材板","擔仔麵"]},
"高雄":{"景點":[
            {"name":"駁二藝術特區","desc":"結合藝術與創意的園區"},
            {"name":"旗津","desc":"享受海鮮美食與海灘風光"},
            {"name":"瑞豐夜市","desc":"高雄最大的夜市之一"}],
        "美食":["鴨肉飯","樺達奶茶","米糕和碗粿"]}}

#====主程式====
city =input("請輸入城市:")
def recommend(city):
    if city in spots:
        spot=random.choice(spots[city]["景點"])
        food=random.choice(spots[city]["美食"])
        return f"推薦景點:{spot['name']}({spot['desc']})\n推薦美食:{food}"
    else:
        return "抱歉，目前尚未支援該城市的推薦。"

print("=====推薦結果=====")
print(recommend(city))
print("謝謝您的使用!")
print("=====END=====")